// let string = "alloha" //строковый тип данных
// //let-неявное объявление переменной
// //string-имя переменной
// //"alloha"-значение переменной
// alert(string)  //всплывающее окошко
// let integer = 10 //целочисленный тип данных
// console.log(integer)  //вывод текста в консоль сайта
// let float = 10.1 //число с плавающей точкой
// let bolean = true //= false
//****************************************

//let num = prompt("введите число для возведения в квадрат")
//внутрь переменной num мы передаем функцию prompt(),
//которая принимает значение числа, вводимое из клавиатуры из браузера, 
//которое в дальнейшем мы будем возводить в квадрат
//num = num ** 2 //мы изменили переменную num и возвели ее значение в квадрат (во вторую степень)
// + сложение (num = num + 1) - значение переменной увеличится на 1
// - вычитание (num = num - 1) - значение переменной уменьшится на 1
// * - умножение (num = num * 1) - умножится на 1
// / - деление (num = num / 1) - делится на 1 
// % - взятие отстатка от деления (num = num % 3) - остаток отделения на 3   
//alert(num)
//выводит значение переменной num на экран
//*****************************************

//let num_first = Number(prompt("введите первое число"))
//let num_second = Number(prompt("введите второе число"))
//sum = num_first + num_second
//alert(sum)
//let mid = (num_first + num_second) / 2
//alert(mid)
//**************************************** 

let num = Number(prompt("введите размер стороны квадрата"))
num **=  2
alert(num)